# Основной граф
graph_26_points = {
    "Гудермес": {
        "Знаменское": 100,
        "Сунжа": 99,
        "Урус-Мартан": 64,
        "Шали": 35,
        "Курчалой": 19,
        "Хасавюрт": 45,
        "Кизляр": 91,
    },
    "Знаменское": {"Гудермес": 100, "Сунжа": 62},
    "Сунжа": {"Знаменское": 62, "Гудермес": 99, "Ачхой-Мартан": 30},
    "Ачхой-Мартан": {"Сунжа": 30, "Урус-Мартан": 24},
    "Урус-Мартан": {"Ачхой-Мартан": 24, "Гудермес": 64, "Шали": 37},
    "Шали": {"Гудермес": 35, "Курчалой": 19, "Урус-Мартан": 37},
    "Курчалой": {"Ведено": 39, "Гудермес": 19, "Шали": 19},
    "Ведено": {"Курчалой": 39, "Хасавюрт": 90},
    "Хасавюрт": {
        "Гудермес": 45,
        "Кизляр": 83,
        "Бабаюрт": 50,
        "Кизилюрт": 30,
        "Ведено": 90,
        "Хунзах": 168,
    },
    "Кизляр": {"Гудермес": 91, "Хасавюрт": 83, "Бабаюрт": 35, "Тарумовка": 39},
    "Бабаюрт": {"Кизляр": 35, "Хасавюрт": 50, "Сулак": 78},
    "Кизилюрт": {"Хасавюрт": 30, "Сулак": 63, "Семендер": 33, "Буйнакск": 60},
    "Семендер": {"Кизилюрт": 57, "Сулак": 40, "Буйнакск": 38, "Каспийск": 33},
    "Сулак": {"Семендер": 40, "Кизилюрт": 63, "Бабаюрт": 78},
    "Буйнакск": {
        "Семендер": 38,
        "Кизилюрт": 60,
        "Хунзах": 95,
        "Гуниб": 63,
        "Леваши": 64,
    },
    "Леваши": {"Гуниб": 48, "Буйнакск": 64, "Сергокала": 41},
    "Сергокала": {"Леваши": 41, "Каспийск": 65, "Каякент": 40},
    "Каспийск": {"Сергокала": 65, "Избербаш": 51, "Семендер": 33},
    "Избербаш": {"Каспийск": 51, "Каякент": 28},
    "Каякент": {"Избербаш": 28, "Сергокала": 40},
    "Хунзах": {"Буйнакск": 95, "Гуниб": 63, "Хасавюрт": 168},
    "Гуниб": {"Хунзах": 63, "Буйнакск": 63, "Леваши": 48},
    "Кочубей": {"Тарумовка": 183},
    "Терекли-Муктеб": {"Тарумовка": 69},
    "Тарумовка": {"Кочубей": 183, "Терекли-Муктеб": 69},
}

# Облегченный граф
graph_7_points = {
    "Гудермес": {"Шали": 35, "Курчалой": 19, "Хасавюрт": 45, "Буйнакск": 80},
    "Шали": {"Гудермес": 35, "Курчалой": 19, "Буйнакск": 70},
    "Курчалой": {"Шали": 19, "Гудермес": 19, "Ведено": 39, "Буйнакск": 55},
    "Ведено": {"Курчалой": 39, "Хасавюрт": 90, "Буйнакск": 100},
    "Хасавюрт": {"Гудермес": 45, "Ведено": 90, "Буйнакск": 60, "Леваши": 120},
    "Буйнакск": {
        "Хасавюрт": 60,
        "Леваши": 64,
        "Шали": 70,
        "Курчалой": 55,
        "Ведено": 100,
    },
    "Леваши": {"Буйнакск": 64, "Хасавюрт": 120},
}

# Облегченный граф с добавлением нового пункта "Избербаш"
graph_8_points = {
    "Гудермес": {"Шали": 35, "Курчалой": 19, "Хасавюрт": 45, "Буйнакск": 80},
    "Шали": {"Гудермес": 35, "Курчалой": 19, "Буйнакск": 70, "Избербаш": 60},
    "Курчалой": {"Шали": 19, "Гудермес": 19, "Ведено": 39, "Буйнакск": 55},
    "Ведено": {"Курчалой": 39, "Хасавюрт": 90, "Буйнакск": 100},
    "Хасавюрт": {"Гудермес": 45, "Ведено": 90, "Буйнакск": 60, "Леваши": 120},
    "Буйнакск": {
        "Хасавюрт": 60,
        "Леваши": 64,
        "Шали": 70,
        "Курчалой": 55,
        "Ведено": 100,
        "Избербаш": 85,
    },
    "Леваши": {"Буйнакск": 64, "Хасавюрт": 120, "Избербаш": 75},
    "Избербаш": {"Шали": 60, "Буйнакск": 85, "Леваши": 75},
}

# Облегченный граф с добавлением нового пункта "Каспийск"
graph_9_points = {
    "Гудермес": {"Шали": 35, "Курчалой": 19, "Хасавюрт": 45, "Буйнакск": 80},
    "Шали": {"Гудермес": 35, "Курчалой": 19, "Буйнакск": 70, "Избербаш": 60},
    "Курчалой": {"Шали": 19, "Гудермес": 19, "Ведено": 39, "Буйнакск": 55},
    "Ведено": {"Курчалой": 39, "Хасавюрт": 90, "Буйнакск": 100},
    "Хасавюрт": {"Гудермес": 45, "Ведено": 90, "Буйнакск": 60, "Леваши": 120},
    "Буйнакск": {
        "Хасавюрт": 60,
        "Леваши": 64,
        "Шали": 70,
        "Курчалой": 55,
        "Ведено": 100,
        "Избербаш": 85,
        "Каспийск": 90,
    },
    "Леваши": {"Буйнакск": 64, "Хасавюрт": 120, "Избербаш": 75, "Каспийск": 55},
    "Избербаш": {"Шали": 60, "Буйнакск": 85, "Леваши": 75, "Каспийск": 30},
    "Каспийск": {"Избербаш": 30, "Буйнакск": 90, "Леваши": 55},
}

# Облегченный граф с добавлением нового пункта "Кизилюрт"
graph_10_points = {
    "Гудермес": {"Шали": 35, "Курчалой": 19, "Хасавюрт": 45, "Буйнакск": 80},
    "Шали": {"Гудермес": 35, "Курчалой": 19, "Буйнакск": 70, "Избербаш": 60},
    "Курчалой": {"Шали": 19, "Гудермес": 19, "Ведено": 39, "Буйнакск": 55},
    "Ведено": {"Курчалой": 39, "Хасавюрт": 90, "Буйнакск": 100},
    "Хасавюрт": {
        "Гудермес": 45,
        "Ведено": 90,
        "Буйнакск": 60,
        "Леваши": 120,
        "Кизилюрт": 40,
    },
    "Буйнакск": {
        "Хасавюрт": 60,
        "Леваши": 64,
        "Шали": 70,
        "Курчалой": 55,
        "Ведено": 100,
        "Избербаш": 85,
        "Каспийск": 90,
        "Кизилюрт": 50,
    },
    "Леваши": {"Буйнакск": 64, "Хасавюрт": 120, "Избербаш": 75, "Каспийск": 55},
    "Избербаш": {"Шали": 60, "Буйнакск": 85, "Леваши": 75, "Каспийск": 30},
    "Каспийск": {"Избербаш": 30, "Буйнакск": 90, "Леваши": 55, "Кизилюрт": 60},
    "Кизилюрт": {"Хасавюрт": 40, "Буйнакск": 50, "Каспийск": 60},
}

# Облегченный граф с добавлением нового пункта "Тарумовка"
graph_11_points = {
    "Гудермес": {"Шали": 35, "Курчалой": 19, "Хасавюрт": 45, "Буйнакск": 80},
    "Шали": {"Гудермес": 35, "Курчалой": 19, "Буйнакск": 70, "Избербаш": 60},
    "Курчалой": {"Шали": 19, "Гудермес": 19, "Ведено": 39, "Буйнакск": 55},
    "Ведено": {"Курчалой": 39, "Хасавюрт": 90, "Буйнакск": 100},
    "Хасавюрт": {
        "Гудермес": 45,
        "Ведено": 90,
        "Буйнакск": 60,
        "Леваши": 120,
        "Кизилюрт": 40,
        "Тарумовка": 75,
    },
    "Буйнакск": {
        "Хасавюрт": 60,
        "Леваши": 64,
        "Шали": 70,
        "Курчалой": 55,
        "Ведено": 100,
        "Избербаш": 85,
        "Каспийск": 90,
        "Кизилюрт": 50,
        "Тарумовка": 45,
    },
    "Леваши": {"Буйнакск": 64, "Хасавюрт": 120, "Избербаш": 75, "Каспийск": 55},
    "Избербаш": {"Шали": 60, "Буйнакск": 85, "Леваши": 75, "Каспийск": 30},
    "Каспийск": {"Избербаш": 30, "Буйнакск": 90, "Леваши": 55, "Кизилюрт": 60},
    "Кизилюрт": {"Хасавюрт": 40, "Буйнакск": 50, "Каспийск": 60},
    "Тарумовка": {"Хасавюрт": 75, "Буйнакск": 45, "Курчалой": 50},
}


# Облегченный граф с добавлением нового пункта "Сулак"
graph_12_points = {
    "Гудермес": {"Шали": 35, "Курчалой": 19, "Хасавюрт": 45, "Буйнакск": 80},
    "Шали": {"Гудермес": 35, "Курчалой": 19, "Буйнакск": 70, "Избербаш": 60},
    "Курчалой": {"Шали": 19, "Гудермес": 19, "Ведено": 39, "Буйнакск": 55},
    "Ведено": {"Курчалой": 39, "Хасавюрт": 90, "Буйнакск": 100},
    "Хасавюрт": {
        "Гудермес": 45,
        "Ведено": 90,
        "Буйнакск": 60,
        "Леваши": 120,
        "Кизилюрт": 40,
        "Тарумовка": 75,
    },
    "Буйнакск": {
        "Хасавюрт": 60,
        "Леваши": 64,
        "Шали": 70,
        "Курчалой": 55,
        "Ведено": 100,
        "Избербаш": 85,
        "Каспийск": 90,
        "Кизилюрт": 50,
        "Тарумовка": 45,
        "Сулак": 78,
    },
    "Леваши": {"Буйнакск": 64, "Хасавюрт": 120, "Избербаш": 75, "Каспийск": 55},
    "Избербаш": {"Шали": 60, "Буйнакск": 85, "Леваши": 75, "Каспийск": 30},
    "Каспийск": {"Избербаш": 30, "Буйнакск": 90, "Леваши": 55, "Кизилюрт": 60},
    "Кизилюрт": {"Хасавюрт": 40, "Буйнакск": 50, "Каспийск": 60},
    "Тарумовка": {"Хасавюрт": 75, "Буйнакск": 45, "Курчалой": 50},
    "Сулак": {"Буйнакск": 78, "Кизилюрт": 63, "Хасавюрт": 85},
}
